# BuiltInFailures.SweptBlendFailures Class

---
Failures about SweptBlend.
SystemObject Autodesk.Revit.DBBuiltInFailuresSweptBlendFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class SweptBlendFailures

    Public NotInheritable Class SweptBlendFailures

    public ref class SweptBlendFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type SweptBlendFailures = class end
The BuiltInFailuresSweptBlendFailures type exposes the following members.
| Name| Description
---|---|---
| CannotDrawSweptblend|  Can't create swept blend.
Top
#### Reference
Autodesk.Revit.DB Namespace